darin-noronha/motor_application/MOTOR Project/TLE9210x_defines.h
/**
 *	@file TLE9210x_defines.h
 *	@author Infineon Technologies AG
 *	@date 11.09.2023
 *	@brief TLE9210x specific device driver implementation from Infineon Technologies AG.
 *
 ************************************************************************
 *
 * Copyright (c) 2023, Infineon Technologies AG
 * All rights reserved.
 *
 ************************************************************************
 */

/** \addtogroup TLE9210x_DEFINES
 *  @{
 */

#ifndef TLE9210x_DEFINES_H
#define TLE9210x_DEFINES_H

/************************************************************************
**                             Includes                                **
************************************************************************/

/************************************************************************
**                      Local Macro Definitions                        **
************************************************************************/

/************************************************************************
**                      Local Type Definitions                         **
************************************************************************/

/************************************************************************
**                    Local Variable Definitions                       **
************************************************************************/

/************************************************************************
**                    Local Function Definitions                       **
************************************************************************/

/************************************************************************
**                    Global Variable Definitions                      **
************************************************************************/

/************************************************************************
**                    Global Function Definitions                      **
************************************************************************/
#define TLE92104 4 /*!< Variant selection for TLE92104 */
//#define TLE92108 8 /*!< Variant selection for TLE92108 */
/**
 * \brief Variant selection for the device driver
 *
 * The variant must be specified for which the device driver shall be built
 */
#define TLE9210x_Variant TLE92104


/*
###############
Control_GENCTRL1
###############
*/
#define TLE9210x_Control_GENCTRL1_INIT 0x0026 /*!< Init value for register Control_GENCTRL1*/
#define TLE9210x_Control_GENCTRL1_CSD2_Pos 15u /*!< CSD2 Bit Position*/
#define TLE9210x_Control_GENCTRL1_CSD2_Mask 0x8000u /*!< CSD2 Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_CSAG2_Pos 13u /*!< CSAG2 Bit Position*/
#define TLE9210x_Control_GENCTRL1_CSAG2_Mask 0x6000u /*!< CSAG2 Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_CSD1_Pos 12u /*!< CSD1 Bit Position*/
#define TLE9210x_Control_GENCTRL1_CSD1_Mask 0x1000u /*!< CSD1 Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_CSAG1_Pos 10u /*!< CSAG1 Bit Position*/
#define TLE9210x_Control_GENCTRL1_CSAG1_Mask 0xc00u /*!< CSAG1 Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_REG_BANK_Pos 9u /*!< REG_BANK Bit Position*/
#define TLE9210x_Control_GENCTRL1_REG_BANK_Mask 0x200u /*!< REG_BANK Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_VSOVTH_Pos 8u /*!< VSOVTH Bit Position*/
#define TLE9210x_Control_GENCTRL1_VSOVTH_Mask 0x100u /*!< VSOVTH Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_UNLOCK_Pos 7u /*!< UNLOCK Bit Position*/
#define TLE9210x_Control_GENCTRL1_UNLOCK_Mask 0x80u /*!< UNLOCK Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_FMODE_Pos 5u /*!< FMODE Bit Position*/
#define TLE9210x_Control_GENCTRL1_FMODE_Mask 0x20u /*!< FMODE Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_IPCHGADT_Pos 3u /*!< IPCHGADT Bit Position*/
#define TLE9210x_Control_GENCTRL1_IPCHGADT_Mask 0x8u /*!< IPCHGADT Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_OCEN_Pos 2u /*!< OCEN Bit Position*/
#define TLE9210x_Control_GENCTRL1_OCEN_Mask 0x4u /*!< OCEN Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_WDPER_Pos 1u /*!< WDPER Bit Position*/
#define TLE9210x_Control_GENCTRL1_WDPER_Mask 0x2u /*!< WDPER Bitfield-Mask */
#define TLE9210x_Control_GENCTRL1_WDTRIG_Pos 0u /*!< WDTRIG Bit Position*/
#define TLE9210x_Control_GENCTRL1_WDTRIG_Mask 0x1u /*!< WDTRIG Bitfield-Mask */

/*
###############
Control_GENCTRL2
###############
*/
#define TLE9210x_Control_GENCTRL2_INIT 0x4180 /*!< Init value for register Control_GENCTRL2*/
#define TLE9210x_Control_GENCTRL2_POCHGDIS_Pos 15u /*!< POCHGDIS Bit Position*/
#define TLE9210x_Control_GENCTRL2_POCHGDIS_Mask 0x8000u /*!< POCHGDIS Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_BD_PASS_Pos 14u /*!< BD_PASS Bit Position*/
#define TLE9210x_Control_GENCTRL2_BD_PASS_Mask 0x4000u /*!< BD_PASS Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_AGCFILT_Pos 13u /*!< AGCFILT Bit Position*/
#define TLE9210x_Control_GENCTRL2_AGCFILT_Mask 0x2000u /*!< AGCFILT Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_AGC_Pos 11u /*!< AGC Bit Position*/
#define TLE9210x_Control_GENCTRL2_AGC_Mask 0x1800u /*!< AGC Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_IHOLD_Pos 10u /*!< IHOLD Bit Position*/
#define TLE9210x_Control_GENCTRL2_IHOLD_Mask 0x400u /*!< IHOLD Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_WDDIS_Pos 9u /*!< WDDIS Bit Position*/
#define TLE9210x_Control_GENCTRL2_WDDIS_Mask 0x200u /*!< WDDIS Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_MSKTDREG_Pos 8u /*!< MSKTDREG Bit Position*/
#define TLE9210x_Control_GENCTRL2_MSKTDREG_Mask 0x100u /*!< MSKTDREG Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_CPUVTH_Pos 7u /*!< CPUVTH Bit Position*/
#define TLE9210x_Control_GENCTRL2_CPUVTH_Mask 0x80u /*!< CPUVTH Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_CPSTGA_Pos 6u /*!< CPSTGA Bit Position*/
#define TLE9210x_Control_GENCTRL2_CPSTGA_Mask 0x40u /*!< CPSTGA Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_TFVDS_Pos 4u /*!< TFVDS Bit Position*/
#define TLE9210x_Control_GENCTRL2_TFVDS_Mask 0x30u /*!< TFVDS Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_OCTH2_Pos 2u /*!< OCTH2 Bit Position*/
#define TLE9210x_Control_GENCTRL2_OCTH2_Mask 0xcu /*!< OCTH2 Bitfield-Mask */
#define TLE9210x_Control_GENCTRL2_OCTH1_Pos 0u /*!< OCTH1 Bit Position*/
#define TLE9210x_Control_GENCTRL2_OCTH1_Mask 0x3u /*!< OCTH1 Bitfield-Mask */

