darin-noronha/motor_application/MOTOR Project/TLE9210x_defines.h
/*
###############
Control_VDS1
###############
*/
#define TLE9210x_Control_VDS1_INIT 0x0249 /*!< Init value for register Control_VDS1*/
#define TLE9210x_Control_VDS1_HB4D_Pos 15u /*!< HB4D Bit Position*/
#define TLE9210x_Control_VDS1_HB4D_Mask 0x8000u /*!< HB4D Bitfield-Mask */
#define TLE9210x_Control_VDS1_HB3D_Pos 14u /*!< HB3D Bit Position*/
#define TLE9210x_Control_VDS1_HB3D_Mask 0x4000u /*!< HB3D Bitfield-Mask */
#define TLE9210x_Control_VDS1_HB2D_Pos 13u /*!< HB2D Bit Position*/
#define TLE9210x_Control_VDS1_HB2D_Mask 0x2000u /*!< HB2D Bitfield-Mask */
#define TLE9210x_Control_VDS1_HB1D_Pos 12u /*!< HB1D Bit Position*/
#define TLE9210x_Control_VDS1_HB1D_Mask 0x1000u /*!< HB1D Bitfield-Mask */
#define TLE9210x_Control_VDS1_HB4VDSTH_Pos 9u /*!< HB4VDSTH Bit Position*/
#define TLE9210x_Control_VDS1_HB4VDSTH_Mask 0xe00u /*!< HB4VDSTH Bitfield-Mask */
#define TLE9210x_Control_VDS1_HB3VDSTH_Pos 6u /*!< HB3VDSTH Bit Position*/
#define TLE9210x_Control_VDS1_HB3VDSTH_Mask 0x1c0u /*!< HB3VDSTH Bitfield-Mask */
#define TLE9210x_Control_VDS1_HB2VDSTH_Pos 3u /*!< HB2VDSTH Bit Position*/
#define TLE9210x_Control_VDS1_HB2VDSTH_Mask 0x38u /*!< HB2VDSTH Bitfield-Mask */
#define TLE9210x_Control_VDS1_HB1VDSTH_Pos 0u /*!< HB1VDSTH Bit Position*/
#define TLE9210x_Control_VDS1_HB1VDSTH_Mask 0x7u /*!< HB1VDSTH Bitfield-Mask */

/*
###############
Control_VDS2
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Control_VDS2_INIT 0x0249 /*!< Init value for register Control_VDS2*/
#define TLE9210x_Control_VDS2_HB8D_Pos 15u /*!< HB8D Bit Position*/
#define TLE9210x_Control_VDS2_HB8D_Mask 0x8000u /*!< HB8D Bitfield-Mask */
#define TLE9210x_Control_VDS2_HB7D_Pos 14u /*!< HB7D Bit Position*/
#define TLE9210x_Control_VDS2_HB7D_Mask 0x4000u /*!< HB7D Bitfield-Mask */
#define TLE9210x_Control_VDS2_HB6D_Pos 13u /*!< HB6D Bit Position*/
#define TLE9210x_Control_VDS2_HB6D_Mask 0x2000u /*!< HB6D Bitfield-Mask */
#define TLE9210x_Control_VDS2_HB5D_Pos 12u /*!< HB5D Bit Position*/
#define TLE9210x_Control_VDS2_HB5D_Mask 0x1000u /*!< HB5D Bitfield-Mask */
#define TLE9210x_Control_VDS2_HB8VDSTH_Pos 9u /*!< HB8VDSTH Bit Position*/
#define TLE9210x_Control_VDS2_HB8VDSTH_Mask 0xe00u /*!< HB8VDSTH Bitfield-Mask */
#define TLE9210x_Control_VDS2_HB7VDSTH_Pos 6u /*!< HB7VDSTH Bit Position*/
#define TLE9210x_Control_VDS2_HB7VDSTH_Mask 0x1c0u /*!< HB7VDSTH Bitfield-Mask */
#define TLE9210x_Control_VDS2_HB6VDSTH_Pos 3u /*!< HB6VDSTH Bit Position*/
#define TLE9210x_Control_VDS2_HB6VDSTH_Mask 0x38u /*!< HB6VDSTH Bitfield-Mask */
#define TLE9210x_Control_VDS2_HB5VDSTH_Pos 0u /*!< HB5VDSTH Bit Position*/
#define TLE9210x_Control_VDS2_HB5VDSTH_Mask 0x7u /*!< HB5VDSTH Bitfield-Mask */
#endif

/*
###############
Control_CCP_BLK1
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Control_CCP_BLK1_HB8CCPBLK_Pos 14u /*!< HB8CCPBLK Bit Position*/
#define TLE9210x_Control_CCP_BLK1_HB8CCPBLK_Mask 0xc000u /*!< HB8CCPBLK Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK1_HB7CCPBLK_Pos 12u /*!< HB7CCPBLK Bit Position*/
#define TLE9210x_Control_CCP_BLK1_HB7CCPBLK_Mask 0x3000u /*!< HB7CCPBLK Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK1_HB6CCPBLK_Pos 10u /*!< HB6CCPBLK Bit Position*/
#define TLE9210x_Control_CCP_BLK1_HB6CCPBLK_Mask 0xc00u /*!< HB6CCPBLK Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK1_HB5CCPBLK_Pos 8u /*!< HB5CCPBLK Bit Position*/
#define TLE9210x_Control_CCP_BLK1_HB5CCPBLK_Mask 0x300u /*!< HB5CCPBLK Bitfield-Mask */
#endif
#define TLE9210x_Control_CCP_BLK1_INIT 0x0000 /*!< Init value for register Control_CCP_BLK1*/
#define TLE9210x_Control_CCP_BLK1_HB4CCPBLK_Pos 6u /*!< HB4CCPBLK Bit Position*/
#define TLE9210x_Control_CCP_BLK1_HB4CCPBLK_Mask 0xc0u /*!< HB4CCPBLK Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK1_HB3CCPBLK_Pos 4u /*!< HB3CCPBLK Bit Position*/
#define TLE9210x_Control_CCP_BLK1_HB3CCPBLK_Mask 0x30u /*!< HB3CCPBLK Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK1_HB2CCPBLK_Pos 2u /*!< HB2CCPBLK Bit Position*/
#define TLE9210x_Control_CCP_BLK1_HB2CCPBLK_Mask 0xcu /*!< HB2CCPBLK Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK1_HB1CCPBLK_Pos 0u /*!< HB1CCPBLK Bit Position*/
#define TLE9210x_Control_CCP_BLK1_HB1CCPBLK_Mask 0x3u /*!< HB1CCPBLK Bitfield-Mask */

/*
###############
Control_CCP_BLK2_ACT
###############
*/
#define TLE9210x_Control_CCP_BLK2_ACT_INIT 0x4924 /*!< Init value for register Control_CCP_BLK2_ACT*/
#define TLE9210x_Control_CCP_BLK2_ACT_TCCP3_ACT_Pos 12u /*!< TCCP3_ACT Bit Position*/
#define TLE9210x_Control_CCP_BLK2_ACT_TCCP3_ACT_Mask 0x7000u /*!< TCCP3_ACT Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK2_ACT_TBLANK2_ACT_Pos 9u /*!< TBLANK2_ACT Bit Position*/
#define TLE9210x_Control_CCP_BLK2_ACT_TBLANK2_ACT_Mask 0xe00u /*!< TBLANK2_ACT Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK2_ACT_TCCP2_ACT_Pos 6u /*!< TCCP2_ACT Bit Position*/
#define TLE9210x_Control_CCP_BLK2_ACT_TCCP2_ACT_Mask 0x1c0u /*!< TCCP2_ACT Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK2_ACT_TBLANK1_ACT_Pos 3u /*!< TBLANK1_ACT Bit Position*/
#define TLE9210x_Control_CCP_BLK2_ACT_TBLANK1_ACT_Mask 0x38u /*!< TBLANK1_ACT Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK2_ACT_TCCP1_ACT_Pos 0u /*!< TCCP1_ACT Bit Position*/
#define TLE9210x_Control_CCP_BLK2_ACT_TCCP1_ACT_Mask 0x7u /*!< TCCP1_ACT Bitfield-Mask */

/*
###############
Control_CCP_BLK2_FW
###############
*/
#define TLE9210x_Control_CCP_BLK2_FW_INIT 0x4924 /*!< Init value for register Control_CCP_BLK2_FW*/
#define TLE9210x_Control_CCP_BLK2_FW_TCCP3_FW_Pos 12u /*!< TCCP3_FW Bit Position*/
#define TLE9210x_Control_CCP_BLK2_FW_TCCP3_FW_Mask 0x7000u /*!< TCCP3_FW Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK2_FW_TBLANK2_FW_Pos 9u /*!< TBLANK2_FW Bit Position*/
#define TLE9210x_Control_CCP_BLK2_FW_TBLANK2_FW_Mask 0xe00u /*!< TBLANK2_FW Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK2_FW_TCCP2_FW_Pos 6u /*!< TCCP2_FW Bit Position*/
#define TLE9210x_Control_CCP_BLK2_FW_TCCP2_FW_Mask 0x1c0u /*!< TCCP2_FW Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK2_FW_TBLANK1_FW_Pos 3u /*!< TBLANK1_FW Bit Position*/
#define TLE9210x_Control_CCP_BLK2_FW_TBLANK1_FW_Mask 0x38u /*!< TBLANK1_FW Bitfield-Mask */
#define TLE9210x_Control_CCP_BLK2_FW_TCCP1_FW_Pos 0u /*!< TCCP1_FW Bit Position*/
#define TLE9210x_Control_CCP_BLK2_FW_TCCP1_FW_Mask 0x7u /*!< TCCP1_FW Bitfield-Mask */

