darin-noronha/motor_application/MOTOR Project/TLE9210x_defines.h
/*
###############
Control_HBMODE
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Control_HBMODE_HB8MODE_Pos 14u /*!< HB8MODE Bit Position*/
#define TLE9210x_Control_HBMODE_HB8MODE_Mask 0xc000u /*!< HB8MODE Bitfield-Mask */
#define TLE9210x_Control_HBMODE_HB7MODE_Pos 12u /*!< HB7MODE Bit Position*/
#define TLE9210x_Control_HBMODE_HB7MODE_Mask 0x3000u /*!< HB7MODE Bitfield-Mask */
#define TLE9210x_Control_HBMODE_HB6MODE_Pos 10u /*!< HB6MODE Bit Position*/
#define TLE9210x_Control_HBMODE_HB6MODE_Mask 0xc00u /*!< HB6MODE Bitfield-Mask */
#define TLE9210x_Control_HBMODE_HB5MODE_Pos 8u /*!< HB5MODE Bit Position*/
#define TLE9210x_Control_HBMODE_HB5MODE_Mask 0x300u /*!< HB5MODE Bitfield-Mask */
#endif
#define TLE9210x_Control_HBMODE_INIT 0x0000 /*!< Init value for register Control_HBMODE*/
#define TLE9210x_Control_HBMODE_HB4MODE_Pos 6u /*!< HB4MODE Bit Position*/
#define TLE9210x_Control_HBMODE_HB4MODE_Mask 0xc0u /*!< HB4MODE Bitfield-Mask */
#define TLE9210x_Control_HBMODE_HB3MODE_Pos 4u /*!< HB3MODE Bit Position*/
#define TLE9210x_Control_HBMODE_HB3MODE_Mask 0x30u /*!< HB3MODE Bitfield-Mask */
#define TLE9210x_Control_HBMODE_HB2MODE_Pos 2u /*!< HB2MODE Bit Position*/
#define TLE9210x_Control_HBMODE_HB2MODE_Mask 0xcu /*!< HB2MODE Bitfield-Mask */
#define TLE9210x_Control_HBMODE_HB1MODE_Pos 0u /*!< HB1MODE Bit Position*/
#define TLE9210x_Control_HBMODE_HB1MODE_Mask 0x3u /*!< HB1MODE Bitfield-Mask */

/*
###############
Control_PWMSET
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Control_PWMSET_INIT 0x6C60 /*!< Init value for register Control_PWMSET*/
#else
#define TLE9210x_Control_PWMSET_INIT 0x6420 /*!< Init value for register Control_PWMSET*/
#endif
#define TLE9210x_Control_PWMSET_PASS_VDS_Pos 14u /*!< PASS_VDS Bit Position*/
#define TLE9210x_Control_PWMSET_PASS_VDS_Mask 0x4000u /*!< PASS_VDS Bitfield-Mask */
#define TLE9210x_Control_PWMSET_PASS_MOD_Pos 12u /*!< PASS_MOD Bit Position*/
#define TLE9210x_Control_PWMSET_PASS_MOD_Mask 0x3000u /*!< PASS_MOD Bitfield-Mask */
#define TLE9210x_Control_PWMSET_PWM3_HB_Pos 9u /*!< PWM3_HB Bit Position*/
#define TLE9210x_Control_PWMSET_PWM3_HB_Mask 0xe00u /*!< PWM3_HB Bitfield-Mask */
#define TLE9210x_Control_PWMSET_PMW3_EN_Pos 8u /*!< PMW3_EN Bit Position*/
#define TLE9210x_Control_PWMSET_PMW3_EN_Mask 0x100u /*!< PMW3_EN Bitfield-Mask */
#define TLE9210x_Control_PWMSET_PWM2_HB_Pos 5u /*!< PWM2_HB Bit Position*/
#define TLE9210x_Control_PWMSET_PWM2_HB_Mask 0xe0u /*!< PWM2_HB Bitfield-Mask */
#define TLE9210x_Control_PWMSET_PWM2_EN_Pos 4u /*!< PWM2_EN Bit Position*/
#define TLE9210x_Control_PWMSET_PWM2_EN_Mask 0x10u /*!< PWM2_EN Bitfield-Mask */
#define TLE9210x_Control_PWMSET_PWM1_HB_Pos 1u /*!< PWM1_HB Bit Position*/
#define TLE9210x_Control_PWMSET_PWM1_HB_Mask 0xeu /*!< PWM1_HB Bitfield-Mask */
#define TLE9210x_Control_PWMSET_PWM1_EN_Pos 0u /*!< PWM1_EN Bit Position*/
#define TLE9210x_Control_PWMSET_PWM1_EN_Mask 0x1u /*!< PWM1_EN Bitfield-Mask */

/*
###############
Control_TPRECHG
###############
*/
#define TLE9210x_Control_TPRECHG_INIT 0x0000 /*!< Init value for register Control_TPRECHG*/
#define TLE9210x_Control_TPRECHG_EN_DEEP_AD_Pos 14u /*!< EN_DEEP_AD Bit Position*/
#define TLE9210x_Control_TPRECHG_EN_DEEP_AD_Mask 0x4000u /*!< EN_DEEP_AD Bitfield-Mask */
#define TLE9210x_Control_TPRECHG_EN_GEN_CHECK_Pos 12u /*!< EN_GEN_CHECK Bit Position*/
#define TLE9210x_Control_TPRECHG_EN_GEN_CHECK_Mask 0x1000u /*!< EN_GEN_CHECK Bitfield-Mask */
#define TLE9210x_Control_TPRECHG_TPDCHG3_Pos 10u /*!< TPDCHG3 Bit Position*/
#define TLE9210x_Control_TPRECHG_TPDCHG3_Mask 0xc00u /*!< TPDCHG3 Bitfield-Mask */
#define TLE9210x_Control_TPRECHG_TPCHG3_Pos 8u /*!< TPCHG3 Bit Position*/
#define TLE9210x_Control_TPRECHG_TPCHG3_Mask 0x300u /*!< TPCHG3 Bitfield-Mask */
#define TLE9210x_Control_TPRECHG_TPDCHG2_Pos 6u /*!< TPDCHG2 Bit Position*/
#define TLE9210x_Control_TPRECHG_TPDCHG2_Mask 0xc0u /*!< TPDCHG2 Bitfield-Mask */
#define TLE9210x_Control_TPRECHG_TPCHG2_Pos 4u /*!< TPCHG2 Bit Position*/
#define TLE9210x_Control_TPRECHG_TPCHG2_Mask 0x30u /*!< TPCHG2 Bitfield-Mask */
#define TLE9210x_Control_TPRECHG_TPDCHG1_Pos 2u /*!< TPDCHG1 Bit Position*/
#define TLE9210x_Control_TPRECHG_TPDCHG1_Mask 0xcu /*!< TPDCHG1 Bitfield-Mask */
#define TLE9210x_Control_TPRECHG_TPCHG1_Pos 0u /*!< TPCHG1 Bit Position*/
#define TLE9210x_Control_TPRECHG_TPCHG1_Mask 0x3u /*!< TPCHG1 Bitfield-Mask */

/*
###############
Control_HBIDIAG
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Control_HBIDIAG_HB8IDIAG_Pos 7u /*!< HB8IDIAG Bit Position*/
#define TLE9210x_Control_HBIDIAG_HB8IDIAG_Mask 0x80u /*!< HB8IDIAG Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_HB7IDIAG_Pos 6u /*!< HB7IDIAG Bit Position*/
#define TLE9210x_Control_HBIDIAG_HB7IDIAG_Mask 0x40u /*!< HB7IDIAG Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_HB6IDIAG_Pos 5u /*!< HB6IDIAG Bit Position*/
#define TLE9210x_Control_HBIDIAG_HB6IDIAG_Mask 0x20u /*!< HB6IDIAG Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_HB5IDIAG_Pos 4u /*!< HB5IDIAG Bit Position*/
#define TLE9210x_Control_HBIDIAG_HB5IDIAG_Mask 0x10u /*!< HB5IDIAG Bitfield-Mask */
#endif
#define TLE9210x_Control_HBIDIAG_INIT 0xC000 /*!< Init value for register Control_HBIDIAG*/
#define TLE9210x_Control_HBIDIAG_CSA2L_Pos 15u /*!< CSA2L Bit Position*/
#define TLE9210x_Control_HBIDIAG_CSA2L_Mask 0x8000u /*!< CSA2L Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_CSA1L_Pos 14u /*!< CSA1L Bit Position*/
#define TLE9210x_Control_HBIDIAG_CSA1L_Mask 0x4000u /*!< CSA1L Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_OC2FILT_Pos 12u /*!< OC2FILT Bit Position*/
#define TLE9210x_Control_HBIDIAG_OC2FILT_Mask 0x3000u /*!< OC2FILT Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_OC1FILT_Pos 10u /*!< OC1FILT Bit Position*/
#define TLE9210x_Control_HBIDIAG_OC1FILT_Mask 0xc00u /*!< OC1FILT Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_CSA2_OFF_Pos 9u /*!< CSA2_OFF Bit Position*/
#define TLE9210x_Control_HBIDIAG_CSA2_OFF_Mask 0x200u /*!< CSA2_OFF Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_CSA1_OFF_Pos 8u /*!< CSA1_OFF Bit Position*/
#define TLE9210x_Control_HBIDIAG_CSA1_OFF_Mask 0x100u /*!< CSA1_OFF Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_HB4IDIAG_Pos 3u /*!< HB4IDIAG Bit Position*/
#define TLE9210x_Control_HBIDIAG_HB4IDIAG_Mask 0x8u /*!< HB4IDIAG Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_HB3IDIAG_Pos 2u /*!< HB3IDIAG Bit Position*/
#define TLE9210x_Control_HBIDIAG_HB3IDIAG_Mask 0x4u /*!< HB3IDIAG Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_HB2IDIAG_Pos 1u /*!< HB2IDIAG Bit Position*/
#define TLE9210x_Control_HBIDIAG_HB2IDIAG_Mask 0x2u /*!< HB2IDIAG Bitfield-Mask */
#define TLE9210x_Control_HBIDIAG_HB1IDIAG_Pos 0u /*!< HB1IDIAG Bit Position*/
#define TLE9210x_Control_HBIDIAG_HB1IDIAG_Mask 0x1u /*!< HB1IDIAG Bitfield-Mask */

