darin-noronha/motor_application/MOTOR Project/TLE9210x_defines.h
/*
###############
Control_ST_ICHG
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Control_ST_ICHG_HB8ICHGST_Pos 15u /*!< HB8ICHGST Bit Position*/
#define TLE9210x_Control_ST_ICHG_HB8ICHGST_Mask 0x8000u /*!< HB8ICHGST Bitfield-Mask */
#define TLE9210x_Control_ST_ICHG_HB7ICHGST_Pos 14u /*!< HB7ICHGST Bit Position*/
#define TLE9210x_Control_ST_ICHG_HB7ICHGST_Mask 0x4000u /*!< HB7ICHGST Bitfield-Mask */
#define TLE9210x_Control_ST_ICHG_HB6ICHGST_Pos 13u /*!< HB6ICHGST Bit Position*/
#define TLE9210x_Control_ST_ICHG_HB6ICHGST_Mask 0x2000u /*!< HB6ICHGST Bitfield-Mask */
#define TLE9210x_Control_ST_ICHG_HB5ICHGST_Pos 12u /*!< HB5ICHGST Bit Position*/
#define TLE9210x_Control_ST_ICHG_HB5ICHGST_Mask 0x1000u /*!< HB5ICHGST Bitfield-Mask */
#endif
#define TLE9210x_Control_ST_ICHG_INIT 0x0044 /*!< Init value for register Control_ST_ICHG*/
#define TLE9210x_Control_ST_ICHG_HB4ICHGST_Pos 11u /*!< HB4ICHGST Bit Position*/
#define TLE9210x_Control_ST_ICHG_HB4ICHGST_Mask 0x800u /*!< HB4ICHGST Bitfield-Mask */
#define TLE9210x_Control_ST_ICHG_HB3ICHGST_Pos 10u /*!< HB3ICHGST Bit Position*/
#define TLE9210x_Control_ST_ICHG_HB3ICHGST_Mask 0x400u /*!< HB3ICHGST Bitfield-Mask */
#define TLE9210x_Control_ST_ICHG_HB2ICHGST_Pos 9u /*!< HB2ICHGST Bit Position*/
#define TLE9210x_Control_ST_ICHG_HB2ICHGST_Mask 0x200u /*!< HB2ICHGST Bitfield-Mask */
#define TLE9210x_Control_ST_ICHG_HB1ICHGST_Pos 8u /*!< HB1ICHGST Bit Position*/
#define TLE9210x_Control_ST_ICHG_HB1ICHGST_Mask 0x100u /*!< HB1ICHGST Bitfield-Mask */
#define TLE9210x_Control_ST_ICHG_ICHGST2_Pos 4u /*!< ICHGST2 Bit Position*/
#define TLE9210x_Control_ST_ICHG_ICHGST2_Mask 0xf0u /*!< ICHGST2 Bitfield-Mask */
#define TLE9210x_Control_ST_ICHG_ICHGST1_Pos 0u /*!< ICHGST1 Bit Position*/
#define TLE9210x_Control_ST_ICHG_ICHGST1_Mask 0xfu /*!< ICHGST1 Bitfield-Mask */

/*
###############
Control_PWM_PCHG_INIT
###############
*/
#define TLE9210x_Control_PWM_PCHG_INIT_INIT 0x18C6 /*!< Init value for register Control_PWM_PCHG_INIT*/
#define TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT3_Pos 10u /*!< PCHGINIT3 Bit Position*/
#define TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT3_Mask 0x7c00u /*!< PCHGINIT3 Bitfield-Mask */
#define TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT2_Pos 5u /*!< PCHGINIT2 Bit Position*/
#define TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT2_Mask 0x3e0u /*!< PCHGINIT2 Bitfield-Mask */
#define TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT1_Pos 0u /*!< PCHGINIT1 Bit Position*/
#define TLE9210x_Control_PWM_PCHG_INIT_PCHGINIT1_Mask 0x1fu /*!< PCHGINIT1 Bitfield-Mask */

/*
###############
Control_PWM_ICHG_ACT
###############
*/
#define TLE9210x_Control_PWM_ICHG_ACT_INIT 0x18C6 /*!< Init value for register Control_PWM_ICHG_ACT*/
#define TLE9210x_Control_PWM_ICHG_ACT_ICHG3_Pos 10u /*!< ICHG3 Bit Position*/
#define TLE9210x_Control_PWM_ICHG_ACT_ICHG3_Mask 0x7c00u /*!< ICHG3 Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHG_ACT_ICHG2_Pos 5u /*!< ICHG2 Bit Position*/
#define TLE9210x_Control_PWM_ICHG_ACT_ICHG2_Mask 0x3e0u /*!< ICHG2 Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHG_ACT_ICHG1_Pos 0u /*!< ICHG1 Bit Position*/
#define TLE9210x_Control_PWM_ICHG_ACT_ICHG1_Mask 0x1fu /*!< ICHG1 Bitfield-Mask */

/*
###############
Control_PWM_ICHG_FW
###############
*/
#define TLE9210x_Control_PWM_ICHG_FW_INIT 0x18C6 /*!< Init value for register Control_PWM_ICHG_FW*/
#define TLE9210x_Control_PWM_ICHG_FW_ICHG3_FW_Pos 10u /*!< ICHG3_FW Bit Position*/
#define TLE9210x_Control_PWM_ICHG_FW_ICHG3_FW_Mask 0x7c00u /*!< ICHG3_FW Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHG_FW_ICHG2_FW_Pos 5u /*!< ICHG2_FW Bit Position*/
#define TLE9210x_Control_PWM_ICHG_FW_ICHG2_FW_Mask 0x3e0u /*!< ICHG2_FW Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHG_FW_ICHG1_FW_Pos 0u /*!< ICHG1_FW Bit Position*/
#define TLE9210x_Control_PWM_ICHG_FW_ICHG1_FW_Mask 0x1fu /*!< ICHG1_FW Bitfield-Mask */

/*
###############
Control_PWM_IDCHG_ACT
###############
*/
#define TLE9210x_Control_PWM_IDCHG_ACT_INIT 0x1CE7 /*!< Init value for register Control_PWM_IDCHG_ACT*/
#define TLE9210x_Control_PWM_IDCHG_ACT_CCSO_Pos 15u /*!< CCSO Bit Position*/
#define TLE9210x_Control_PWM_IDCHG_ACT_CCSO_Mask 0x8000u /*!< CCSO Bitfield-Mask */
#define TLE9210x_Control_PWM_IDCHG_ACT_IDCHG3_Pos 10u /*!< IDCHG3 Bit Position*/
#define TLE9210x_Control_PWM_IDCHG_ACT_IDCHG3_Mask 0x7c00u /*!< IDCHG3 Bitfield-Mask */
#define TLE9210x_Control_PWM_IDCHG_ACT_IDCHG2_Pos 5u /*!< IDCHG2 Bit Position*/
#define TLE9210x_Control_PWM_IDCHG_ACT_IDCHG2_Mask 0x3e0u /*!< IDCHG2 Bitfield-Mask */
#define TLE9210x_Control_PWM_IDCHG_ACT_IDCHG1_Pos 0u /*!< IDCHG1 Bit Position*/
#define TLE9210x_Control_PWM_IDCHG_ACT_IDCHG1_Mask 0x1fu /*!< IDCHG1 Bitfield-Mask */

/*
###############
Control_PWM_PDCHG_INIT
###############
*/
#define TLE9210x_Control_PWM_PDCHG_INIT_INIT 0x318C /*!< Init value for register Control_PWM_PDCHG_INIT*/
#define TLE9210x_Control_PWM_PDCHG_INIT_CCSO_Pos 15u /*!< CCSO Bit Position*/
#define TLE9210x_Control_PWM_PDCHG_INIT_CCSO_Mask 0x8000u /*!< CCSO Bitfield-Mask */
#define TLE9210x_Control_PWM_PDCHG_INIT_PDCHGINIT3_Pos 10u /*!< PDCHGINIT3 Bit Position*/
#define TLE9210x_Control_PWM_PDCHG_INIT_PDCHGINIT3_Mask 0x7c00u /*!< PDCHGINIT3 Bitfield-Mask */
#define TLE9210x_Control_PWM_PDCHG_INIT_PDCHGINIT2_Pos 5u /*!< PDCHGINIT2 Bit Position*/
#define TLE9210x_Control_PWM_PDCHG_INIT_PDCHGINIT2_Mask 0x3e0u /*!< PDCHGINIT2 Bitfield-Mask */
#define TLE9210x_Control_PWM_PDCHG_INIT_PDCHGINIT1_Pos 0u /*!< PDCHGINIT1 Bit Position*/
#define TLE9210x_Control_PWM_PDCHG_INIT_PDCHGINIT1_Mask 0x1fu /*!< PDCHGINIT1 Bitfield-Mask */

/*
###############
Control_PWM_ICHGMAX_CCP_BLK3_ACT
###############
*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_INIT 0x4900 /*!< Init value for register Control_PWM_ICHGMAX_CCP_BLK3_ACT*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_TBLANK4_ACT_Pos 12u /*!< TBLANK4_ACT Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_TBLANK4_ACT_Mask 0x7000u /*!< TBLANK4_ACT Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_TCCP4_ACT_Pos 9u /*!< TCCP4_ACT Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_TCCP4_ACT_Mask 0xe00u /*!< TCCP4_ACT Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_TBLANK3_ACT_Pos 6u /*!< TBLANK3_ACT Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_TBLANK3_ACT_Mask 0x1c0u /*!< TBLANK3_ACT Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX3_Pos 4u /*!< ICHGMAX3 Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX3_Mask 0x30u /*!< ICHGMAX3 Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX2_Pos 2u /*!< ICHGMAX2 Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX2_Mask 0xcu /*!< ICHGMAX2 Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX1_Pos 0u /*!< ICHGMAX1 Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_ACT_ICHGMAX1_Mask 0x3u /*!< ICHGMAX1 Bitfield-Mask */

