darin-noronha/motor_application/MOTOR Project/TLE9210x_defines.h
/*
###############
Control_PWM_ICHGMAX_CCP_BLK3_FW
###############
*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_INIT 0x4900 /*!< Init value for register Control_PWM_ICHGMAX_CCP_BLK3_FW*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK4_FW_Pos 12u /*!< TBLANK4_FW Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK4_FW_Mask 0x7000u /*!< TBLANK4_FW Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TCCP4_FW_Pos 9u /*!< TCCP4_FW Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TCCP4_FW_Mask 0xe00u /*!< TCCP4_FW Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK3_FW_Pos 6u /*!< TBLANK3_FW Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_TBLANK3_FW_Mask 0x1c0u /*!< TBLANK3_FW Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX3_Pos 4u /*!< ICHGMAX3 Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX3_Mask 0x30u /*!< ICHGMAX3 Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX2_Pos 2u /*!< ICHGMAX2 Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX2_Mask 0xcu /*!< ICHGMAX2 Bitfield-Mask */
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX1_Pos 0u /*!< ICHGMAX1 Bit Position*/
#define TLE9210x_Control_PWM_ICHGMAX_CCP_BLK3_FW_ICHGMAX1_Mask 0x3u /*!< ICHGMAX1 Bitfield-Mask */

/*
###############
Control_TDON_OFF1
###############
*/
#define TLE9210x_Control_TDON_OFF1_INIT 0x0A0A /*!< Init value for register Control_TDON_OFF1*/
#define TLE9210x_Control_TDON_OFF1_TDOFF1_Pos 8u /*!< TDOFF1 Bit Position*/
#define TLE9210x_Control_TDON_OFF1_TDOFF1_Mask 0xff00u /*!< TDOFF1 Bitfield-Mask */
#define TLE9210x_Control_TDON_OFF1_TDON1_Pos 0u /*!< TDON1 Bit Position*/
#define TLE9210x_Control_TDON_OFF1_TDON1_Mask 0xffu /*!< TDON1 Bitfield-Mask */

/*
###############
Control_TDON_OFF2
###############
*/
#define TLE9210x_Control_TDON_OFF2_INIT 0x0A0A /*!< Init value for register Control_TDON_OFF2*/
#define TLE9210x_Control_TDON_OFF2_TDOFF2_Pos 8u /*!< TDOFF2 Bit Position*/
#define TLE9210x_Control_TDON_OFF2_TDOFF2_Mask 0xff00u /*!< TDOFF2 Bitfield-Mask */
#define TLE9210x_Control_TDON_OFF2_TDON2_Pos 0u /*!< TDON2 Bit Position*/
#define TLE9210x_Control_TDON_OFF2_TDON2_Mask 0xffu /*!< TDON2 Bitfield-Mask */

/*
###############
Control_TDON_OFF3
###############
*/
#define TLE9210x_Control_TDON_OFF3_INIT 0x0A0A /*!< Init value for register Control_TDON_OFF3*/
#define TLE9210x_Control_TDON_OFF3_TDOFF3_Pos 8u /*!< TDOFF3 Bit Position*/
#define TLE9210x_Control_TDON_OFF3_TDOFF3_Mask 0xff00u /*!< TDOFF3 Bitfield-Mask */
#define TLE9210x_Control_TDON_OFF3_TDON3_Pos 0u /*!< TDON3 Bit Position*/
#define TLE9210x_Control_TDON_OFF3_TDON3_Mask 0xffu /*!< TDON3 Bitfield-Mask */

/*
###############
Status_GENSTAT
###############
*/
#define TLE9210x_Status_GENSTAT_INIT 0x0 /*!< Init value for register Status_GENSTAT*/
#define TLE9210x_Status_GENSTAT_PASS_VDSOV_Pos 15u /*!< PASS_VDSOV Bit Position*/
#define TLE9210x_Status_GENSTAT_PASS_VDSOV_Mask 0x8000u /*!< PASS_VDSOV Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_WDMON_Pos 13u /*!< WDMON Bit Position*/
#define TLE9210x_Status_GENSTAT_WDMON_Mask 0x6000u /*!< WDMON Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_PWM3STAT_Pos 12u /*!< PWM3STAT Bit Position*/
#define TLE9210x_Status_GENSTAT_PWM3STAT_Mask 0x1000u /*!< PWM3STAT Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_PWM2STAT_Pos 11u /*!< PWM2STAT Bit Position*/
#define TLE9210x_Status_GENSTAT_PWM2STAT_Mask 0x800u /*!< PWM2STAT Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_PWM1STAT_Pos 10u /*!< PWM1STAT Bit Position*/
#define TLE9210x_Status_GENSTAT_PWM1STAT_Mask 0x400u /*!< PWM1STAT Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_TDREG3_Pos 9u /*!< TDREG3 Bit Position*/
#define TLE9210x_Status_GENSTAT_TDREG3_Mask 0x200u /*!< TDREG3 Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_TDREG2_Pos 8u /*!< TDREG2 Bit Position*/
#define TLE9210x_Status_GENSTAT_TDREG2_Mask 0x100u /*!< TDREG2 Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_TDREG1_Pos 7u /*!< TDREG1 Bit Position*/
#define TLE9210x_Status_GENSTAT_TDREG1_Mask 0x80u /*!< TDREG1 Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_TSD_Pos 6u /*!< TSD Bit Position*/
#define TLE9210x_Status_GENSTAT_TSD_Mask 0x40u /*!< TSD Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_TW_Pos 5u /*!< TW Bit Position*/
#define TLE9210x_Status_GENSTAT_TW_Mask 0x20u /*!< TW Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_OC2_Pos 4u /*!< OC2 Bit Position*/
#define TLE9210x_Status_GENSTAT_OC2_Mask 0x10u /*!< OC2 Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_OC1_Pos 3u /*!< OC1 Bit Position*/
#define TLE9210x_Status_GENSTAT_OC1_Mask 0x8u /*!< OC1 Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_VSOV_Pos 2u /*!< VSOV Bit Position*/
#define TLE9210x_Status_GENSTAT_VSOV_Mask 0x4u /*!< VSOV Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_VSUV_Pos 1u /*!< VSUV Bit Position*/
#define TLE9210x_Status_GENSTAT_VSUV_Mask 0x2u /*!< VSUV Bitfield-Mask */
#define TLE9210x_Status_GENSTAT_CPUV_Pos 0u /*!< CPUV Bit Position*/
#define TLE9210x_Status_GENSTAT_CPUV_Mask 0x1u /*!< CPUV Bitfield-Mask */

/*
###############
Status_DSOV
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Status_DSOV_LS8DSOV_Pos 15u /*!< LS8DSOV Bit Position*/
#define TLE9210x_Status_DSOV_LS8DSOV_Mask 0x8000u /*!< LS8DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_HS8DSOV_Pos 14u /*!< HS8DSOV Bit Position*/
#define TLE9210x_Status_DSOV_HS8DSOV_Mask 0x4000u /*!< HS8DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_LS7DSOV_Pos 13u /*!< LS7DSOV Bit Position*/
#define TLE9210x_Status_DSOV_LS7DSOV_Mask 0x2000u /*!< LS7DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_HS7DSOV_Pos 12u /*!< HS7DSOV Bit Position*/
#define TLE9210x_Status_DSOV_HS7DSOV_Mask 0x1000u /*!< HS7DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_LS6DSOV_Pos 11u /*!< LS6DSOV Bit Position*/
#define TLE9210x_Status_DSOV_LS6DSOV_Mask 0x800u /*!< LS6DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_HS6DSOV_Pos 10u /*!< HS6DSOV Bit Position*/
#define TLE9210x_Status_DSOV_HS6DSOV_Mask 0x400u /*!< HS6DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_LS5DSOV_Pos 9u /*!< LS5DSOV Bit Position*/
#define TLE9210x_Status_DSOV_LS5DSOV_Mask 0x200u /*!< LS5DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_HS5DSOV_Pos 8u /*!< HS5DSOV Bit Position*/
#define TLE9210x_Status_DSOV_HS5DSOV_Mask 0x100u /*!< HS5DSOV Bitfield-Mask */
#endif
#define TLE9210x_Status_DSOV_INIT 0x0 /*!< Init value for register Status_DSOV*/
#define TLE9210x_Status_DSOV_LS4DSOV_Pos 7u /*!< LS4DSOV Bit Position*/
#define TLE9210x_Status_DSOV_LS4DSOV_Mask 0x80u /*!< LS4DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_HS4DSOV_Pos 6u /*!< HS4DSOV Bit Position*/
#define TLE9210x_Status_DSOV_HS4DSOV_Mask 0x40u /*!< HS4DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_LS3DSOV_Pos 5u /*!< LS3DSOV Bit Position*/
#define TLE9210x_Status_DSOV_LS3DSOV_Mask 0x20u /*!< LS3DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_HS3DSOV_Pos 4u /*!< HS3DSOV Bit Position*/
#define TLE9210x_Status_DSOV_HS3DSOV_Mask 0x10u /*!< HS3DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_LS2DSOV_Pos 3u /*!< LS2DSOV Bit Position*/
#define TLE9210x_Status_DSOV_LS2DSOV_Mask 0x8u /*!< LS2DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_HS2DSOV_Pos 2u /*!< HS2DSOV Bit Position*/
#define TLE9210x_Status_DSOV_HS2DSOV_Mask 0x4u /*!< HS2DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_LS1DSOV_Pos 1u /*!< LS1DSOV Bit Position*/
#define TLE9210x_Status_DSOV_LS1DSOV_Mask 0x2u /*!< LS1DSOV Bitfield-Mask */
#define TLE9210x_Status_DSOV_HS1DSOV_Pos 0u /*!< HS1DSOV Bit Position*/
#define TLE9210x_Status_DSOV_HS1DSOV_Mask 0x1u /*!< HS1DSOV Bitfield-Mask */

