darin-noronha/motor_application/MOTOR Project/TLE9210x_defines.h
/*
###############
Status_HBVOUT_PWMERR
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Status_HBVOUT_PWMERR_HB8PWME_Pos 15u /*!< HB8PWME Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB8PWME_Mask 0x8000u /*!< HB8PWME Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB7PWME_Pos 14u /*!< HB7PWME Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB7PWME_Mask 0x4000u /*!< HB7PWME Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB6PWME_Pos 13u /*!< HB6PWME Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB6PWME_Mask 0x2000u /*!< HB6PWME Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB5PWME_Pos 12u /*!< HB5PWME Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB5PWME_Mask 0x1000u /*!< HB5PWME Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB8VOUT_Pos 7u /*!< HB8VOUT Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB8VOUT_Mask 0x80u /*!< HB8VOUT Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB7VOUT_Pos 6u /*!< HB7VOUT Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB7VOUT_Mask 0x40u /*!< HB7VOUT Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB6VOUT_Pos 5u /*!< HB6VOUT Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB6VOUT_Mask 0x20u /*!< HB6VOUT Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB5VOUT_Pos 4u /*!< HB5VOUT Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB5VOUT_Mask 0x10u /*!< HB5VOUT Bitfield-Mask */
#endif
#define TLE9210x_Status_HBVOUT_PWMERR_INIT 0x0 /*!< Init value for register Status_HBVOUT_PWMERR*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB4PWME_Pos 11u /*!< HB4PWME Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB4PWME_Mask 0x800u /*!< HB4PWME Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB3PWME_Pos 10u /*!< HB3PWME Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB3PWME_Mask 0x400u /*!< HB3PWME Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB2PWME_Pos 9u /*!< HB2PWME Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB2PWME_Mask 0x200u /*!< HB2PWME Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB1PWME_Pos 8u /*!< HB1PWME Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB1PWME_Mask 0x100u /*!< HB1PWME Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB4VOUT_Pos 3u /*!< HB4VOUT Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB4VOUT_Mask 0x8u /*!< HB4VOUT Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB3VOUT_Pos 2u /*!< HB3VOUT Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB3VOUT_Mask 0x4u /*!< HB3VOUT Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB2VOUT_Pos 1u /*!< HB2VOUT Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB2VOUT_Mask 0x2u /*!< HB2VOUT Bitfield-Mask */
#define TLE9210x_Status_HBVOUT_PWMERR_HB1VOUT_Pos 0u /*!< HB1VOUT Bit Position*/
#define TLE9210x_Status_HBVOUT_PWMERR_HB1VOUT_Mask 0x1u /*!< HB1VOUT Bitfield-Mask */

/*
###############
Status_EFF_TDON_OFF1
###############
*/
#define TLE9210x_Status_EFF_TDON_OFF1_INIT 0x0 /*!< Init value for register Status_EFF_TDON_OFF1*/
#define TLE9210x_Status_EFF_TDON_OFF1_TDOFF1EFF_Pos 8u /*!< TDOFF1EFF Bit Position*/
#define TLE9210x_Status_EFF_TDON_OFF1_TDOFF1EFF_Mask 0xff00u /*!< TDOFF1EFF Bitfield-Mask */
#define TLE9210x_Status_EFF_TDON_OFF1_TDON1EFF_Pos 0u /*!< TDON1EFF Bit Position*/
#define TLE9210x_Status_EFF_TDON_OFF1_TDON1EFF_Mask 0xffu /*!< TDON1EFF Bitfield-Mask */

/*
###############
Status_EFF_TDON_OFF2
###############
*/
#define TLE9210x_Status_EFF_TDON_OFF2_INIT 0x0 /*!< Init value for register Status_EFF_TDON_OFF2*/
#define TLE9210x_Status_EFF_TDON_OFF2_TDOFF2EFF_Pos 8u /*!< TDOFF2EFF Bit Position*/
#define TLE9210x_Status_EFF_TDON_OFF2_TDOFF2EFF_Mask 0xff00u /*!< TDOFF2EFF Bitfield-Mask */
#define TLE9210x_Status_EFF_TDON_OFF2_TDON2EFF_Pos 0u /*!< TDON2EFF Bit Position*/
#define TLE9210x_Status_EFF_TDON_OFF2_TDON2EFF_Mask 0xffu /*!< TDON2EFF Bitfield-Mask */

/*
###############
Status_EFF_TDON_OFF3
###############
*/
#define TLE9210x_Status_EFF_TDON_OFF3_INIT 0x0 /*!< Init value for register Status_EFF_TDON_OFF3*/
#define TLE9210x_Status_EFF_TDON_OFF3_TDOFF3EFF_Pos 8u /*!< TDOFF3EFF Bit Position*/
#define TLE9210x_Status_EFF_TDON_OFF3_TDOFF3EFF_Mask 0xff00u /*!< TDOFF3EFF Bitfield-Mask */
#define TLE9210x_Status_EFF_TDON_OFF3_TDON3EFF_Pos 0u /*!< TDON3EFF Bit Position*/
#define TLE9210x_Status_EFF_TDON_OFF3_TDON3EFF_Mask 0xffu /*!< TDON3EFF Bitfield-Mask */

/*
###############
Status_TRISE_FALL1
###############
*/
#define TLE9210x_Status_TRISE_FALL1_INIT 0x0 /*!< Init value for register Status_TRISE_FALL1*/
#define TLE9210x_Status_TRISE_FALL1_TFALL1_Pos 8u /*!< TFALL1 Bit Position*/
#define TLE9210x_Status_TRISE_FALL1_TFALL1_Mask 0xff00u /*!< TFALL1 Bitfield-Mask */
#define TLE9210x_Status_TRISE_FALL1_TRISE1_Pos 0u /*!< TRISE1 Bit Position*/
#define TLE9210x_Status_TRISE_FALL1_TRISE1_Mask 0xffu /*!< TRISE1 Bitfield-Mask */

/*
###############
Status_TRISE_FALL2
###############
*/
#define TLE9210x_Status_TRISE_FALL2_INIT 0x0 /*!< Init value for register Status_TRISE_FALL2*/
#define TLE9210x_Status_TRISE_FALL2_TFALL2_Pos 8u /*!< TFALL2 Bit Position*/
#define TLE9210x_Status_TRISE_FALL2_TFALL2_Mask 0xff00u /*!< TFALL2 Bitfield-Mask */
#define TLE9210x_Status_TRISE_FALL2_TRISE2_Pos 0u /*!< TRISE2 Bit Position*/
#define TLE9210x_Status_TRISE_FALL2_TRISE2_Mask 0xffu /*!< TRISE2 Bitfield-Mask */

/*
###############
Status_TRISE_FALL3
###############
*/
#define TLE9210x_Status_TRISE_FALL3_INIT 0x0 /*!< Init value for register Status_TRISE_FALL3*/
#define TLE9210x_Status_TRISE_FALL3_TFALL3_Pos 8u /*!< TFALL3 Bit Position*/
#define TLE9210x_Status_TRISE_FALL3_TFALL3_Mask 0xff00u /*!< TFALL3 Bitfield-Mask */
#define TLE9210x_Status_TRISE_FALL3_TRISE3_Pos 0u /*!< TRISE3 Bit Position*/
#define TLE9210x_Status_TRISE_FALL3_TRISE3_Mask 0xffu /*!< TRISE3 Bitfield-Mask */

/*
###############
Status_DEVID
###############
*/
#if TLE9210x_Variant == TLE92108
#define TLE9210x_Status_DEVID_INIT 0x01 /*!< Init value for register Status_DEVID*/
#else
#define TLE9210x_Status_DEVID_INIT 0x81 /*!< Init value for register Status_DEVID*/
#endif
#define TLE9210x_Status_DEVID_DEV_ID_Pos 0u /*!< DEV_ID Bit Position*/
#define TLE9210x_Status_DEVID_DEV_ID_Mask 0x7u /*!< DEV_ID Bitfield-Mask */

/** @}*/ /* End of group TLE9210x_DEFINES */

#endif /* TLE9210x_DEFINES_H */
